***** 260(%ecx,%edx)
			#+BEGIN_SRC sh
			printf "%x\n" 260
			#+END_SRC

			#+RESULTS:
			: 104

***** 0xFC(,%ecx,4)
			#+BEGIN_SRC clojure
			(format "%x" (+ 0xFC (* 4 0x3)))
			#+END_SRC

			#+RESULTS:
			: 108

***** 0xFC(,%ecx,4)
			#+BEGIN_SRC clojure
			(format "%x" (+ 0xFC (* 4 0x1)))
			#+END_SRC

			#+RESULTS:
			: 100

			Val for 0x100 = 0xFF



*** Why is the stack pointer incrimented by 4?

	 #+BEGIN_SRC clojure
	 (/ 32 8)
	 #+END_SRC

	 #+RESULTS:
	 : 4
	 ..32 bits divided into bytes equals 4 bytes per 32bit word.
	 Therefore an increment in 4 bytes is an increment in a 32bit word.
	 

**** The Code
		 #+BEGIN_SRC C++ :includes <stdio.h>
       void decode1(int *xp, int *yp, int *zp){
         int ty = *yp;
         int tz = *zp;
         int tx = *xp;

         *yp = tx;
         *zp = ty;
         *xp = tz;
       }

       int main(){
         int x = 1;
         int y = 2;
         int z = 3;
         decode1(&x, &y, &z);

         printf("x = %d, y = %d, z = %d\n", x, y ,z);
       }
		 #+END_SRC

		 #+RESULTS:
		 | x = 3 | y = 1 | z = 2 |





		 
